Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/aho.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: The workshop was a part of an ongoing collaboration between the research group Future North, AHO and Vardø Restored, a platform for place development located at Varanger Museum in Vardø.
nb: Workshopen var en del av et større prosjekt kalt Vardø Restored som er organisert mellom forskningsgruppen Future North, AHO og Vardø Restored, en platform for stedsutvikling med base i Varanger museum i Vardø.

source: Research methodologies, ethics and results are explained and demonstrated as an integrated part of the teaching.
nb: Forskningsmetoder, etikk og resultater forklares og demonstreres som en integrert del av undervisningen.

source: Students in the master program in design prioritize studio and elective courses as described above.
nb: Studenter i masterprogrammet i design prioriterer studio og fordypningskurs ut fra ønsker.

source: For Master studies at Columbia University GSAPP
nb: For Masterstudier ved Columbia University

source: And therefore, we can only design services and systems that affect us, and that challenges the very core of user-centred design”, Manuela explains.
nb: Derfor kan vi bare designe tjenester og systemer som påvirker oss, og det utfordrer selve kjernen i brukersentrert design», forklarer Manuela.

source: The professor in architecture at AHO Espen Surnevik received the prestigious "European Steel Design Award 2019" on Monday, October 14th.
nb: Professor ved institutt for arkitektur på AHO Espen Surnevik ble tildelt den prestisjetunge prisen "European Steel Design Award 2019" mandag 14.

source: Using advanced 3D modelling, video-sketching and other various forms of prototyping is therefore central to the course.
nb: Bruk av avansert 3D modellering, video og andre ulike former for prototyping er derfor sentralt i kurset.

source: AHO has Direct Digital Manufacturing labs, and the most current IT resources.
nb: Undervisningen er bygd opp av prosjektarbeid, studiereiser og praktisk arbeid på tegnesaler og i kurs.

source: Studio tutorials on an individual and group basis regarding design and research by design, as well as instructions towards skill building
nb: Studioundervisning på individuell og gruppe-basis vedrørende design og 'research by design', samt instruksjoner for utvikling av ferdigheter.

source: The education brings together aesthetics and technology, creativity and design methods, culture and research.
nb: Utdanningen knytter sammen estetikk og teknologi, kreativitet og designmetoder, kultur og forskning.

source: Welcome to the exhibition for the course Digital fabrication, technologies and processes.
nb: Velkommen til utstillingen til kurset Digital fabrication, technologies and processes.

source: The assignment will be to make design for a small private museum for American abstract painter Cy Twombley, based on a sett of criteria chosen from the learning from Norwegian architect Sverre Fehn.
nb: Oppgaven vil være å tegne et mindre privat museum for Amerikansk abstrakt maler Cy Twombley, basert på et sett av kriterier valgt ut fra Sverre Fehns arkitekturlærdom.

source: Recommended reading (not mandatory)
nb: Anbefalt literatur (foreløpig)

source: research group with the support of Professor Birger Sevaldson and Professor Andrew Morrison from AHO's
nb: med støtte fra professor Birger Sevaldson og professor Andrew Morrison fra

source: For the fall of 2020, the Space & Technique Guest Studio has been asked to work with the Bahrain Pearling Path, a Unesco World Heritage serial site in Muharraq, Bahrain.
nb: Høsten 2020 har Space & Technique Guest Studio blitt bedt om å samarbeide med Bahrain Pearling Path, et Unesco verdensarv-område i Muharraq, Bahrain.

source: A new cooperative course between architecture and design
nb: Nytt samarbeidskurs mellom arkitektur og design

source: Another Chinese school with which Per Olaf has had a long association is the Central Academy of Fine Arts in Beijing.
nb: En annen kinesisk skole som Per Olaf har hatt lang forbindelse med er Central Academy of Fine Arts i Beijing.

source: Track 02 (recommended for returners to the studio) will focus on adapting and developing the design approach towards performative envelopes to a mid- to large size building scheme in Oslo, with the aim to organize an entire building based on the element that divides exterior from interior.
nb: Spor 02 (anbefales for studenter som har deltatt ved studioet tidligere) vil fokusere på å tilpasse og utvikle designtilnærmingen mot performative fasader for et middels til stort bygningsprosjekt i Oslo, med sikte på en helhetlig organisering av en bygning basert på elementet som deler eksteriør fra interiør.

source: She has her own practice as part of Gaia architects in Gaia-Oslo as, Nesodden, and works with projects that are practical sustainable solutions.
nb: Hun har sin egen praksis som en del av Gaia arkitekter i Gaia-Oslo AS på Nesodden og arbeider med prosjekter som har som mål å få til praktiske bærekraftige løsninger.

source: - A reflective, constructive and critical stance to his or her own disciplinary interests, strengths and weaknesses.
nb: - En reflekterende, konstruktiv og kritisk holdning til egne faglige interesser, styrker og svakheter.

source: Despite the pandemic, Per Olaf Fjeld has been very active and has received several inquiries from Southeast University in Nanjing, China.
nb: Til tross for pandemien har Per Olaf Fjeld vært svært aktiv og med flere henvendelser fra Southeast University i Nanjing, Kina.

source: You use your regular AHO username and password to access (Feide username and password).
nb: Du bruker ditt vanlige AHO brukernavn og passord for å få tilgang (feidebrukernavn og passord).

source: Designer's Saturday at AHO
nb: Designers saturday på AHO

source: Learning the tools, concepts and methods from system-oriented design.
nb: Lære verktøyene, konseptene og metodene fra systemorientert design.

source: - to take up a challenge to work with very complex problems,
nb: å ta en utfordring å jobbe med svært komplekse problemer,

source: At AHO Birgitta has taught Service Design, Tangible Interaction, Sensorial and Musical interaction and e-textiles.
nb: Birgitta har ved AHO undervist i Service Design, Tangible Interaction, Interaksjonsdesign, Sensorisk og musikalsk interaksjon og e-tekstil, samt veiledet en rekke Masteroppgaver.

source: Regulation for Master Studies at AHO‚ pt. 6-14.
nb: Forskrift for masterstudiene ved AHO § 6-14.

source: Here you can search in both AHO’s library and Norwegian libraries.
nb: Her kan du søke i AHO-biblioteket eller i norske fagbibliotek.
